app/views/index/_form.html.erb

SELECT `careers`.* FROM `careers`
---
    <%= form.label "Carrera" %><br>
    <%= form.select :career, options_for_select(Career.all.map{|p|[p.career]}), prompt: "Seleccionar" %>