app/controllers/careers_controller.rb

SELECT careers.id, careers.career, tests.indentifier FROM `careers` INNER JOIN `tests` ON `tests`.`id` = `careers`.`test_id`
---
  def index
    @careers = Career.joins(:test).select("careers.id, careers.career, tests.indentifier")