app/controllers/classifications_controller.rb

  def index
    @classifications = Classification.all
---
SELECT `classifications`.* FROM `classifications`

    def set_classification
      @classification = Classification.find(params[:id])
---
SELECT  `classifications`.* FROM `classifications` WHERE `classifications`.`id` = 1 LIMIT 1