app/controllers/students_controller.rb

  def index
  	if params["data"].present?
  		if params["data"]["filter"] != nil
	  		case params["data"]["filter"]
			when "Nombre"
			  @students = Student.where("name LIKE ?", "%#{params["data"]["value"]}%")
			when "Primer Apellido"
			  @students = Student.where("lastname LIKE ?", "%#{params["data"]["value"]}%")
			when "Segundo Apellido"
			  @students = Student.where("second_lastname LIKE ?", "%#{params["data"]["value"]}%")
			when "Identificacion"
			  @students = Student.where("identifier LIKE ?", "%#{params["data"]["value"]}%")
			when "Carrera"
			  @students = Student.where("career LIKE ?", "%#{params["data"]["value"]}%")
			else
			  @students = Student.all
---
SELECT `students`.* FROM `students`