app/controllers/tests_controller.rb

SELECT `tests`.* FROM `tests`
---
  def index
    @tests = Test.all